Documents/ЗагрузкаАналогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ЗагрузкаАналогов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АналогиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимПоиска</Name>
					<Comment>0 - авртикул, 1 - код</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварыСтр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураСтр</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бренд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Производители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БрендСтр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удалено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗагрузкаАналогов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ОбработатьПоискНаСервере()
	
	//ВЫБРАТЬ
	//	Номенклатура, Аналог,
	//	ВЫБОР КОГДА ПОДСТРОКА(Аналог, 1, 1) ПОДОБНО "[+=-.]" ТОГДА "" ИНАЧЕ ПОДСТРОКА(Аналог, 1, 1) КОНЕЦ +
	//	ВЫБОР КОГДА ПОДСТРОКА(Аналог, 2, 1) ПОДОБНО "[+=-.]" ТОГДА "" ИНАЧЕ ПОДСТРОКА(Аналог, 2, 1) КОНЕЦ +
	//	ВЫБОР КОГДА ПОДСТРОКА(Аналог, 3, 1) ПОДОБНО "[.-]" ТОГДА "" ИНАЧЕ ПОДСТРОКА(Аналог, 3, 1) КОНЕЦ +
	//	ВЫБОР КОГДА ПОДСТРОКА(Аналог, 4, 1) ПОДОБНО "[.-]" ТОГДА "" ИНАЧЕ ПОДСТРОКА(Аналог, 4, 1) КОНЕЦ +
	//	ВЫБОР КОГДА ПОДСТРОКА(Аналог, 5, 1) ПОДОБНО "[.-]" ТОГДА "" ИНАЧЕ ПОДСТРОКА(Аналог, 5, 1) КОНЕЦ +
	//	ВЫБОР КОГДА ПОДСТРОКА(Аналог, 6, 1) ПОДОБНО "[.-]" ТОГДА "" ИНАЧЕ ПОДСТРОКА(Аналог, 6, 1) КОНЕЦ +
	//	ВЫБОР КОГДА ПОДСТРОКА(Аналог, 7, 1) ПОДОБНО "[.-]" ТОГДА "" ИНАЧЕ ПОДСТРОКА(Аналог, 7, 1) КОНЕЦ +
	//	ВЫБОР КОГДА ПОДСТРОКА(Аналог, 8, 1) ПОДОБНО "[.-]" ТОГДА "" ИНАЧЕ ПОДСТРОКА(Аналог, 8, 1) КОНЕЦ +
	//	ВЫБОР КОГДА ПОДСТРОКА(Аналог, 9, 1) ПОДОБНО "[.-]" ТОГДА "" ИНАЧЕ ПОДСТРОКА(Аналог, 9, 1) КОНЕЦ +
	//	ВЫБОР КОГДА ПОДСТРОКА(Аналог, 10, 1) ПОДОБНО "[.-]" ТОГДА "" ИНАЧЕ ПОДСТРОКА(Аналог, 10, 1) КОНЕЦ +
	//	ВЫБОР КОГДА ПОДСТРОКА(Аналог, 11, 1) ПОДОБНО "[.-]" ТОГДА "" ИНАЧЕ ПОДСТРОКА(Аналог, 1, 1) КОНЕЦ +
	//	ВЫБОР КОГДА ПОДСТРОКА(Аналог, 12, 1) ПОДОБНО "[.-]" ТОГДА "" ИНАЧЕ ПОДСТРОКА(Аналог, 12, 1) КОНЕЦ +
	//	ВЫБОР КОГДА ПОДСТРОКА(Аналог, 13, 1) ПОДОБНО "[.-]" ТОГДА "" ИНАЧЕ ПОДСТРОКА(Аналог, 13, 1) КОНЕЦ +
	//	ВЫБОР КОГДА ПОДСТРОКА(Аналог, 14, 1) ПОДОБНО "[.-]" ТОГДА "" ИНАЧЕ ПОДСТРОКА(Аналог, 14, 1) КОНЕЦ
	//ИЗ 
	//	РегистрСведений.СТ_Аналоги
	//ГДЕ
	//	
	//	//Аналог ПОДОБНО "[0-9][0-9][0-9]" // "09.109.77.43.0"
	//	Аналог ПОДОБНО "09[.]109.77.43.0"
	
	Запрос = Новый Запрос(СтрШаблон("
	|ВЫБРАТЬ Табл.БрендСтр КАК Бренд ПОМЕСТИТЬ ТабБренды ИЗ &Бренды Табл;
	
	|ВЫБРАТЬ 	Ссылка КАК Значение, %1 КлючДоОбработки
	|ИЗ 		Справочник.Номенклатура
	|ГДЕ		%1 В(&Артикулы);
	
	|ВЫБРАТЬ Ссылка Значение, ЕСТЬNULL(Бренд, Наименование) Ключ
	|ИЗ	Справочник.Производители Спр
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ ТабБренды Таб
	|ПО Спр.Наименование = Таб.Бренд
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ключ
	|", 
		?(Объект.РежимПоиска, "Код", "Артикул")));
	
	табБренд = Объект.Товары.Выгрузить(,"БрендСтр");
	табБренд.Свернуть("БрендСтр");
	
	Запрос.УстановитьПараметр("Артикулы", 	Объект.Товары.Выгрузить(,"НоменклатураСтр").ВыгрузитьКолонку("НоменклатураСтр"));
	Запрос.УстановитьПараметр("Бренды", 	табБренд);
	
	Пакет = Запрос.ВыполнитьПакет();
	Артикулы 	= Пакет[1].Выгрузить();
	Бренды 		= Пакет[2].Выгрузить();
	Бренды.Свернуть("Ключ, Значение");
	
	Артикулы.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Строка"));
	Для Каждого Строка Из Артикулы Цикл
		Строка.Ключ = СокрЛП(Строка.КлючДоОбработки);
	КонецЦикла;
	
	ТЗТов = Объект.Товары.Выгрузить();
	ТЗТов.Свернуть("Номенклатура, НоменклатураСтр, Бренд, БрендСтр, Артикул");
	Объект.Товары.Загрузить(ТЗТов);
	
	Для Каждого Строка Из Объект.Товары Цикл
		
		Строка.Номенклатура = ПолучитьЗначениеИзНайденного(Артикулы, 	Строка.НоменклатураСтр, Строка.Номенклатура);
		Строка.Бренд 		= ПолучитьЗначениеИзНайденного(Бренды, 		Строка.БрендСтр, 		Строка.Бренд);
		
	КонецЦикла;
	
КонецПроцедуры
&НаСервере
Функция ПолучитьЗначениеИзНайденного(Табл, Ключ, стЗначение)
	
	Если ЗначениеЗаполнено(стЗначение) Тогда
		Возврат стЗначение;
	Иначе
	
		стрПоиска = Табл.Найти(Ключ, "Ключ");
		
		Если стрПоиска <> Неопределено Тогда
			Возврат стрПоиска.Значение;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьИзФайла(Команда)
	
	ОткрытьФорму("Документ.ЗагрузкаАналогов.Форма.ФормаЗагрузки",,ЭтаФорма,,,,Новый ОписаниеОповещения("ЗагрузкаФайлаЗаверешена", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
&НаКлиенте
Процедура ЗагрузкаФайлаЗаверешена(Данные, ДопПараметры) Экспорт
	
	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		
		ВыгрузкаТоваров 	= Данные.Данные;
		Объект.РежимПоиска 	= Данные.РежимПоиска;
		
		Объект.Товары.Очистить();
		
		Для КАждого Строка Из Данные.Данные Цикл
			ЗаполнитьЗначенияСвойств(Объект.Товары.Добавить(), Строка);
		КонецЦикла;
		
		ОбработатьПоискНаСервере();
		
		ПоказатьОповещениеПользователя("");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуПоВсем(Пометка)
	
	Для Каждого Строка Из Объект.Товары Цикл
		
		Строка.Удалено = Пометка;
		
	КонецЦикла;
	
КонецПроцедуры
&НаКлиенте
Процедура СнятьПометкуСоВсех(Команда)
	
	УстановитьПометкуПоВсем(Ложь);
	
КонецПроцедуры
&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	УстановитьПометкуПоВсем(Истина);
	
КонецПроцедуры
